solvers/postProcess/NusseltCalc/pipe/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    wall
    {
        type   noSlip;
    }

    inlet
    { 
    	type      surfaceNormalFixedValue;
	refValue  uniform -1.0;	
    }

    outlet
    {
	type pressureInletOutletVelocity;
	value uniform (0 0 0);
    }

}

// ************************************************************************* //
