solvers/postProcess/NusseltCalc/pipe/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 295;

boundaryField
{
    
    wall
    {
       type            fixedGradient;
       gradient           uniform 3541.7343;
    }
    outlet
    {
        type            zeroGradient;
        
    }
    inlet
    {
        type            fixedValue;
        value           uniform 295;
    }
    
}


// ************************************************************************* //
